Autodesk.Revit.DB.ForceGbxmlExportMode
force which system to use for export with test scripts through the API.
Since:
2015

Autodesk.Revit.DB.ForceGbxmlExportMode.ATF
Force export with new atf exporter.

Autodesk.Revit.DB.ForceGbxmlExportMode.AIM
Force export with legacy exporter.

Autodesk.Revit.DB.ForceGbxmlExportMode.Default
Don't force anything.